DataProcessors/омг_ПроверкаИПерезаполнениеЦенПродажПоСтраховымПрограммам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_ПроверкаИПерезаполнениеЦенПродажПоСтраховымПрограммам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>омг_Набор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сертификатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетФирмы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныСпециализаций</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкиЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_ИсходнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_СоглашенияСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСертификата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специализации</Name>
					<Comment>Для целей расчета з/п</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Прейскуранты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Прейскурант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_НоменклатураНаборов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВНаборе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаОбщая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВложенныйНабор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/омг_ПроверкаИПерезаполнениеЦенПродажПоСтраховымПрограммам/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	
	Если Не Параметры.Документ.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УстановкаЦен.омг_Организация КАК Организация,
		               |	УстановкаЦен.Дата КАК Дата
		               |ИЗ
		               |	Документ.УстановкаЦен КАК УстановкаЦен
		               |ГДЕ
		               |	УстановкаЦен.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	УстановкаЦеномг_Филиалы.Филиал КАК Филиал
		               |ИЗ
		               |	Документ.УстановкаЦен.омг_Филиалы КАК УстановкаЦеномг_Филиалы
		               |ГДЕ
		               |	УстановкаЦеномг_Филиалы.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	УстановкаЦеномг_Прейскуранты.Прейскурант КАК Прейскурант
		               |ИЗ
		               |	Документ.УстановкаЦен.омг_Прейскуранты КАК УстановкаЦеномг_Прейскуранты
		               |ГДЕ
		               |	УстановкаЦеномг_Прейскуранты.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Параметры.Документ);
		ПакетРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаОрганизация = ПакетРезультатов.Получить(0).Выбрать();
		ВыборкаОрганизация.Следующий();
		Организация = ВыборкаОрганизация.Организация;
		ПериодДокументов.ДатаНачала = НачалоМесяца(ВыборкаОрганизация.Дата);
		ПериодДокументов.ДатаОкончания = КонецМесяца(ВыборкаОрганизация.Дата);
		Дата = ВыборкаОрганизация.Дата;
		ВыборкаФилиалы = ПакетРезультатов.Получить(1).Выбрать();
		Пока ВыборкаФилиалы.Следующий() Цикл
			Филиалы.Добавить(ВыборкаФилиалы.Филиал);
		КонецЦикла;
		
		ВыборкаПрейскуранты = ПакетРезультатов.Получить(2).Выбрать();
		Пока ВыборкаПрейскуранты.Следующий() Цикл
			СтраховыеПрограммы.Добавить(ВыборкаПрейскуранты.Прейскурант);
		КонецЦикла;
		
	Иначе
		
		ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
		Если ЭтоПолныеПрава Тогда
			
			ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
			
			Настройки = ХранилищеОбщихНастроек.Загрузить(ИмяФормы, "Настройки",, 
				ИмяПользователя);
			Если Не Настройки = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки,, "Дата");
			КонецЕсли;
			
			
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПрейскурантНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = СтраховыеПрограммы;
	Отбор = Новый Структура("Организация", Организация);
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Параметр, Значение", "Дата", Дата));
	
	Отбор.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	СложныеОтборы = Новый Массив;
	СложныеОтборы.Добавить("&Дата МЕЖДУ ДатаНачала И ДатаОкончания");
	
	Отбор.Вставить("СложныеОтборы", СложныеОтборы);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "СоглашенияСтрахования", СписокВыбранных, Отбор), Элементы.СтраховыеПрограммы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = Филиалы;
	Отбор = Новый Структура("Организация", Организация);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Филиалы", СписокВыбранных, Отбор), Элементы.Филиалы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляБезналаНаПанелиИзОплаты(ЭТНаФорме, ОплатаБезналомНаФорме, Знач ТабЧастьОплата, Знач Филиал, Знач Касса, Знач НСПК_СпособОплаты)
	
	СтрокаБезнал = Неопределено;
	
	Для Каждого СтрокаОплаты Из ТабЧастьОплата Цикл
		
		Если СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные") Тогда
			СтрокаБезнал = СтрокаОплаты;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаБезнал <> Неопределено Тогда
		ОплатаБезналомНаФорме = СтрокаБезнал.Сумма;
		ЭТНаФорме			  = СтрокаБезнал.ЭквайринговыйТерминал;
	Иначе
		ЭТНаФорме = РаботаСТорговымОборудованием.ПолучитьЭквайринговыйТерминал(, Филиал, Касса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерезаполнениеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |	ЦеныНоменклатурыСрезПоследних.Прейскурант КАК Прейскурант,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Набор КАК омг_Набор,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТ_ЦеныПоСтраховым
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Дата,
	               |			омг_Филиал В (&Филиалы)
	               |				И Прейскурант В (&СтраховыеПрограммы)) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
	               |	ОказаниеУслугРаботы.НомерСтроки КАК НомерСтроки,
	               |	ОказаниеУслугРаботы.Цена КАК Цена,
	               |	ВТ_ЦеныПоСтраховым.Цена КАК НоваяЦена
	               |ИЗ
	               |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |		ПО (ОказаниеУслугРаботы.Ссылка = ОказаниеУслуг.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоСтраховым КАК ВТ_ЦеныПоСтраховым
	               |		ПО ОказаниеУслуг.Филиал = ВТ_ЦеныПоСтраховым.омг_Филиал
	               |			И ОказаниеУслуг.омг_СтраховаяПрограмма = ВТ_ЦеныПоСтраховым.Прейскурант
	               |			И ((ОказаниеУслугРаботы.Номенклатура, ОказаниеУслугРаботы.омг_Набор) В
	               |				(ВЫБРАТЬ
	               |					ВТ_ЦеныПоСтраховым.Номенклатура КАК Номенклатура,
	               |					ВТ_ЦеныПоСтраховым.омг_Набор КАК омг_Набор
	               |				ИЗ
	               |					ВТ_ЦеныПоСтраховым КАК ВТ_ЦеныПоСтраховым))
	               |			И (ОказаниеУслугРаботы.Номенклатура = ВТ_ЦеныПоСтраховым.Номенклатура)
	               |			И (ОказаниеУслугРаботы.омг_Набор = ВТ_ЦеныПоСтраховым.омг_Набор)
	               |ГДЕ
	               |	ОказаниеУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ОказаниеУслуг.Филиал В(&Филиалы)
	               |	И ОказаниеУслуг.омг_СтраховаяПрограмма В(&СтраховыеПрограммы)
	               |	И НЕ ВТ_ЦеныПоСтраховым.Цена ЕСТЬ NULL
	               |	И ВЫБОР
	               |			КОГДА &ТолькоИзменения
	               |				ТОГДА ЕСТЬNULL(ВТ_ЦеныПоСтраховым.Цена, 0) <> ОказаниеУслугРаботы.Цена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ОказаниеУслуг.Проведен
	               |ИТОГИ ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодДокументов.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодДокументов.ДатаОкончания);
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("СтраховыеПрограммы", СтраховыеПрограммы);
	Запрос.УстановитьПараметр("ТолькоИзменения", Не ПерезаполнитьВсеДокументыЗаПериод);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Начало перезаполнения документов " + ТекущаяДата();
	Сообщение.Сообщить();
	
	Проведено = 0;
	
	СтруктураДокумента = Новый Структура;
	СтруктураСтроки = Новый Структура;
	Для Каждого Реквизит Из Метаданные.Документы.ОказаниеУслуг.Реквизиты Цикл
		СтруктураДокумента.Вставить(Реквизит.Имя);
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Документы.ОказаниеУслуг.ТабличныеЧасти.Работы.Реквизиты Цикл
		СтруктураСтроки.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	ДанныеФормы = Новый Структура("ЭквайринговыйТерминалНаФорме, ОплаченоБезналичным",, 0);
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		Документы.ОказаниеУслуг.омг_РаботаСНДС(ДокументОбъект);	
		ДанныеФормы.ЭквайринговыйТерминалНаФорме = Неопределено;
		ДанныеФормы.ОплаченоБезналичным = 0;
		ЗаполнитьПоляБезналаНаПанелиИзОплаты(ДанныеФормы.ЭквайринговыйТерминалНаФорме, ДанныеФормы.ОплаченоБезналичным, 
			ДокументОбъект.Оплата, ДокументОбъект.Филиал, ДокументОбъект.Касса, Неопределено);
			
		ЗаполнитьЗначенияСвойств(СтруктураДокумента, ДокументОбъект);
		
		ВыборкаСтроки = ВыборкаДокументы.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			СтрокаТаблицы = ДокументОбъект.Работы.Найти(ВыборкаСтроки.НомерСтроки, "НомерСтроки");
			Если СтрокаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы.Цена = ВыборкаСтроки.НоваяЦена;
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);
			РаботаСДокументамиКлиентСервер.омг_РассчитатьСуммуСкидкиСтрокиТабЧасти(СтруктураДокумента, "Товары", СтруктураСтроки);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСтроки);
			
		КонецЦикла;
		РаботаСДокументамиКлиентСервер.РасчитатьСуммуДокументаОказанияУслуг(ДокументОбъект);
		Документы.ОказаниеУслуг.омг_ПересчитатьОплатыНаСервере(ДокументОбъект, ДанныеФормы);
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Проведено = Проведено + 1;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось провести документ " + ДокументОбъект.Ссылка;
			Сообщение.КлючДанных = ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Всего перезаполнено " + Проведено + " из " + ВыборкаДокументы.Количество();
	Сообщение.Сообщить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПерезаполнение(Команда)
	ВыполнитьПерезаполнениеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция омг_ОтобратьФилиалыПоОрганизации(Знач Филиалы, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Филиалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Филиалы КАК Филиалы
	               |ГДЕ
	               |	Филиалы.Ссылка В(&Филиалы)
	               |	И Филиалы.Организация = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	Филиалы.Очистить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Филиалы;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Филиалы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Филиалы;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Филиалы = омг_ОтобратьФилиалыПоОрганизации(Филиалы, Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
	Если Параметры.Документ.Пустая() И ЭтоПолныеПрава Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
			Если Реквизит.Имя = "Объект" Тогда
				Продолжить;
			КонецЕсли;
			СтруктураРеквизитов.Вставить(Реквизит.Имя);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ЭтаФорма);
		
		ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		
		ХранилищеОбщихНастроек.Сохранить(ИмяФормы, "Настройки", СтруктураРеквизитов,, ИмяПользователя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройки();

КонецПроцедуры
